CSI API ETABS v1
eMatCoupledType Enumeration
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public enum eMatCoupledType
Public Enumeration eMatCoupledType
Dim instance As eMatCoupledType
public enum class eMatCoupledType
type eMatCoupledType
Members
Member name | Value | Description
None | 1
VonMisesPlasticity | 2
ModifiedDarwinPecknoldConcrete | 3
See Also
Reference
ETABSv1 Namespace